/* ContentView.swift */
"Work Time" = "Work Time";
"Rest Time" = "Rest Time";
"Long Rest Time" = "Long Rest Time";
"Today: %d 🍅" = "Today: %d 🍅";
"This Week: %d 🍅" = "This Week: %d 🍅";
"Total: %d 🍅" = "Total: %d 🍅";
"Date" = "Date";
"Count" = "Count";
"Work Round Count" = "Work Round Count";
"Show Chart" = "Show Chart";
"Reset" = "Reset";
"Quit" = "Quit";
"Switch Current Phase" = "Switch Current Phase";
"Open Settings" = "Open Settings";
"Show past 7 days progress chart" = "Show past 7 days progress chart";
"Quit Pomodoro Timer Lite" = "Quit Pomodoro Timer Lite";

/* SettingsView.swift */
"Start automatically when computer starts" = "Start automatically when computer starts";
"⏱ Auto Start Control" = "⏱ Auto Start Control";
"🔔 Sound" = "🔔 Sound";
"Enable Sound" = "Enable Sound";
"Notification Sound" = "Notification Sound";
"Ping" = "Ping";
"Glass" = "Glass";
"Hero" = "Hero";
"Tink" = "Tink";
"Purr" = "Purr";
"Basso" = "Basso";
"Blow" = "Blow";
"Bottle" = "Bottle";
"Frog" = "Frog";
"Funk" = "Funk";
"Pop" = "Pop";
"Sosumi" = "Sosumi";
"⏲ Duration (Minutes)" = "⏲ Duration (Minutes)";
"Auto Start Work on First Launch Each Day" = "Auto Start Work on First Launch Each Day";
"Auto Start Rest After Work" = "Auto Start Rest After Work";
"Auto Start Work After Rest" = "Auto Start Work After Rest";
"Enable Long Rest" = "Enable Long Rest";
"Work Duration: %d" = "Work Duration: %d";
"Short Rest Duration: %d" = "Short Rest Duration: %d";
"Long Rest Duration: %d" = "Long Rest Duration: %d";
"Long Rest After %d Rounds" = "Long Rest After %d Rounds";
"Settings" = "Settings";
"⌨️ Keyboard Shortcuts" = "⌨️ Keyboard Shortcuts";
"Show Window" = "Show Window";
"Start/Pause" = "Start/Pause";
"Switch Mode" = "Switch Mode";
"💡 Tip: If you don't see the tomato icon in the menu bar, use ⌘⇧T to show the window and locate the icon. To reposition: hold ⌘ and drag less-used icons to the left (hidden area) to make room for frequently-used apps." = "💡 Tip: If you don't see the tomato icon in the menu bar, use ⌘ ⇧ T to show the window and locate the icon. To reposition: hold ⌘ and drag less-used icons to the left (hidden area) to make room for frequently-used apps.";

/* StatusBarController.swift */
"Quit Pomodoro Timer Lite" = "Quit Pomodoro Timer Lite";

/* PomodoroTimer.swift - Notifications */
"🍅 Pomodoro Session Ended" = "🍅 Pomodoro Session Ended";
"Rest is over. Time to focus!" = "Rest is over. Time to focus!";
"Work completed. Take a break!" = "Work completed. Take a break!";

/* Statistics Export */
"📊 Statistics Export" = "📊 Statistics Export";
"Export to CSV" = "Export to CSV";
"Weekly Report (PDF)" = "Weekly Report (PDF)";
"Monthly Report (PDF)" = "Monthly Report (PDF)";
"All-Time Report (PDF)" = "All-Time Report (PDF)";

/* StatisticsExporter.swift - CSV Export */
"Export Statistics to CSV" = "Export Statistics to CSV";
"Date" = "Date";
"Cumulative Total" = "Cumulative Total";

/* StatisticsExporter.swift - PDF Export */
"Export %@ Report" = "Export %@ Report";
"Export Successful" = "Export Successful";
"Export Failed" = "Export Failed";
"Report exported to %@" = "Report exported to %@";

/* PDF Report Content */
"Weekly" = "Weekly";
"Monthly" = "Monthly";
"All-Time" = "All-Time";
"Generated: %@" = "Generated: %@";
"Summary" = "Summary";
"Total sessions in period: %d" = "Total sessions in period: %d";
"Number of days: %d" = "Number of days: %d";
"Average sessions per day: %.1f" = "Average sessions per day: %.1f";
"Most productive day: %@ (%d sessions)" = "Most productive day: %@ (%d sessions)";
"sessions" = "sessions";
"All-time total sessions: %d" = "All-time total sessions: %d";
"Activity Chart" = "Activity Chart";
"Weekly Overview" = "Weekly Overview";
"Daily Breakdown" = "Daily Breakdown";
"Sessions" = "Sessions";

/* Achievements */
"🏆 Achievements" = "🏆 Achievements";
"Unlocked: %d/%d" = "Unlocked: %d/%d";
"View All" = "View All";
"View Achievements" = "View Achievements";
"Achievements" = "Achievements";
"achievements.title" = "Achievements";
"achievements.current_streak" = "%d day streak";
"Today: %d" = "Today: %d";
"Week: %d" = "Week: %d";
"Total: %d" = "Total: %d";
"%d days" = "%d days";

/* Achievements Window Tabs */
"Badges" = "Badges";
"Statistics" = "Statistics";
"Last 7 Days" = "Last 7 Days";
"Last 30 Days" = "Last 30 Days";
"Last 52 Weeks" = "Last 52 Weeks";
"All Time" = "All Time";
"Current Streak" = "Current Streak";
"Total Days" = "Total Days";
"Total Sessions" = "Total Sessions";
"Average per Day" = "Average per Day";
"Average per Week" = "Average per Week";
"Daily Sessions" = "Daily Sessions";
"Weekly Sessions" = "Weekly Sessions";
"Week" = "Week";
"This week: %d" = "This week: %d";

/* Achievement Titles */
"achievement.first_session.title" = "First Focus";
"achievement.first_session.desc" = "Complete your first pomodoro session";
"achievement.sessions_10.title" = "Getting Started";
"achievement.sessions_10.desc" = "Complete 10 pomodoro sessions";
"achievement.sessions_50.title" = "Dedicated";
"achievement.sessions_50.desc" = "Complete 50 pomodoro sessions";
"achievement.sessions_100.title" = "Centurion";
"achievement.sessions_100.desc" = "Complete 100 pomodoro sessions";
"achievement.sessions_500.title" = "Master of Focus";
"achievement.sessions_500.desc" = "Complete 500 pomodoro sessions";
"achievement.sessions_1000.title" = "Legend";
"achievement.sessions_1000.desc" = "Complete 1000 pomodoro sessions";
"achievement.streak_7.title" = "Week Warrior";
"achievement.streak_7.desc" = "Use the app for 7 consecutive days";
"achievement.streak_30.title" = "Monthly Master";
"achievement.streak_30.desc" = "Use the app for 30 consecutive days";
"achievement.streak_100.title" = "Consistency Champion";
"achievement.streak_100.desc" = "Use the app for 100 consecutive days";

/* About Window */
"app.name" = "Pomodoro Timer Lite";
"About Pomodoro Timer Lite" = "About Pomodoro Timer Lite";
"Version %@ (Build %@)" = "Version %@ (Build %@)";
"A simple and elegant Pomodoro timer for macOS. Stay focused, boost productivity, and manage your time effectively with the Pomodoro Technique." = "A simple and elegant Pomodoro timer for macOS. Stay focused, boost productivity, and manage your time effectively with the Pomodoro Technique.";
"Developer:" = "Developer:";
"Copyright:" = "Copyright:";
"System Requirements:" = "System Requirements:";
"View on App Store" = "View on App Store";
"Rate on App Store" = "Rate on App Store";
"Open Source on GitHub" = "Open Source on GitHub";
"Licensed under MIT License" = "Licensed under MIT License";

/* Achievement Notifications */
"🏆 Achievement Unlocked!" = "🏆 Achievement Unlocked!";
"You've earned the \"%@\" badge!" = "You've earned the \"%@\" badge!";
"🎉 Congratulations on unlocking new achievements!" = "🎉 Congratulations on unlocking new achievements!";
"Dismiss" = "Dismiss";

/* Chart Tooltip */
"session" = "session";
"sessions" = "sessions";
